src/main/resources/Inera/schemas/interactions/GetFunctionalStatusInteraction/GetFunctionalStatusInteraction_2.0_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='GetFunctionalStatusInteraction' 
  xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' 
  xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' 
  xmlns:xs='http://www.w3.org/2001/XMLSchema' 
  xmlns:tjsr='urn:riv:clinicalprocess:healthcond:description:GetFunctionalStatusResponder:2' 
  xmlns:tjsi='urn:riv:clinicalprocess:healthcond:description:GetFunctionalStatusInitiator:2' 
  xmlns:tns='urn:riv:clinicalprocess:healthcond:description:GetFunctionalStatus:2:rivtabp21' 
  targetNamespace='urn:riv:clinicalprocess:healthcond:description:GetFunctionalStatus:2:rivtabp21' xmlns:itr='urn:riv:itintegration:registry:1'>

  <wsdl:documentation>
    Tjänsteinteraktionens namn: GetFunctionalStatusInteraction
    Beskrivning:
      Returnerar dokumenterade bedömning av funktionsnedsättningar och/eller aktivitetsförmåga för en patient.
	Revisioner:
	Tjänstedomän: clinicalprocess:healthcond:description
    Tjänsteinteraktionstyp: Fråga-Svar
	WS-profil: RIVTABP21
	Förvaltas av: Sveriges Kommuner och Landsting
  </wsdl:documentation>

  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:clinicalprocess:healthcond:description:GetFunctionalStatus:2:rivtabp21'>
      <xs:import schemaLocation='GetFunctionalStatusResponder_2.0.xsd' namespace='urn:riv:clinicalprocess:healthcond:description:GetFunctionalStatusResponder:2' />
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='GetFunctionalStatusRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
      <wsdl:documentation></wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:GetFunctionalStatus' />
  </wsdl:message>
  <wsdl:message name='GetFunctionalStatusResponse'>
    <wsdl:part name='parameters' element='tjsr:GetFunctionalStatusResponse' />
  </wsdl:message>
  <wsdl:portType name='GetFunctionalStatusResponderInterface'>
    <wsdl:operation name='GetFunctionalStatus'>
      <wsdl:input message='tns:GetFunctionalStatusRequest' />
      <wsdl:output message='tns:GetFunctionalStatusResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='GetFunctionalStatusResponderBinding' type='tns:GetFunctionalStatusResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='GetFunctionalStatus'>
      <soap:operation soapAction='urn:riv:clinicalprocess:healthcond:description:GetFunctionalStatusResponder:2:GetFunctionalStatus' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:GetFunctionalStatusRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='GetFunctionalStatusResponderService'>
    <wsdl:port name='GetFunctionalStatusResponderPort' binding='tns:GetFunctionalStatusResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
